* Outline
** Intro
- significance of quantum thermo
- prior art
- overview of our method and its capabilities/advantages
- short intro into our example application

*** TODO Find out which papers to cite
- from my thesis
- from konstantins
- new stuff from cyril?

** Energy Flow with HOPS
- short intro about structure of section

*** NMQSD
- very brief
- mostly cite other papers

*** HOPS
- same: brief and cite
- introduce notation

*** Energy Flow
- demonstrate one bath/linear in detail
- finite temperature too

*** Generalizations
- list and explain expressions: nonlinear, finite temp, general observables
- refer to appendix for details?

** Application
- short outline of applications
- mention the analytic verification and refer to thesis?

*** One Bath: Energy Transfer Tuning
- simplest case: one bath, zero T

*** Two Bath
- otto motor setup
- cite papers that looked at it

- see [[file:notes/cycle_design.xopp][sketch of cycle and units]]

**** DONE Reproduce Basic Cycle
:LOGBOOK:
CLOCK: [2022-11-29 Tue 10:35]--[2022-11-29 Tue 11:01] =>  0:26
CLOCK: [2022-11-29 Tue 09:41]--[2022-11-29 Tue 10:21] =>  0:40
CLOCK: [2022-11-28 Mon 18:12]--[2022-11-28 Mon 21:19] =>  3:07
CLOCK: [2022-11-28 Mon 17:42]--[2022-11-28 Mon 18:07] =>  0:25
CLOCK: [2022-11-28 Mon 16:50]--[2022-11-28 Mon 17:16] =>  0:26
CLOCK: [2022-11-28 Mon 16:21]--[2022-11-28 Mon 16:46] =>  0:25
CLOCK: [2022-11-28 Mon 15:50]--[2022-11-28 Mon 16:15] =>  0:25
CLOCK: [2022-11-28 Mon 15:10]--[2022-11-28 Mon 15:40] =>  0:30
CLOCK: [2022-11-28 Mon 14:55]--[2022-11-28 Mon 15:10] =>  0:15
CLOCK: [2022-11-28 Mon 20:51]--[2022-11-28 Mon 20:54] =>  0:03
:END:

- reproduced the cycle from the master's thesis with new code

**** Simple: Continously Coupled vs Modulated Coupling
:LOGBOOK:
CLOCK: [2022-12-02 Fri 12:40]--[2022-12-02 Fri 13:07] =>  0:27
CLOCK: [2022-12-02 Fri 11:52]--[2022-12-02 Fri 12:35] =>  0:43
CLOCK: [2022-12-02 Fri 11:52]--[2022-12-02 Fri 11:52] =>  0:00
CLOCK: [2022-12-01 Thu 17:30]--[2022-12-01 Thu 18:30] =>  1:00
CLOCK: [2022-12-01 Thu 11:45]--[2022-12-01 Thu 12:42] =>  0:57
CLOCK: [2022-12-01 Thu 11:00]--[2022-12-01 Thu 11:30] =>  0:30
CLOCK: [2022-12-01 Thu 10:33]--[2022-12-01 Thu 10:56] =>  0:23
:END:

- see also what happens if we overlap modulation of hamiltonian and
  coupling

**** Simple: Coupling Work
- what happens if coupling modulation and hamiltonian modulation
  happen at the same time?

**** TODO verify what has been done
- carnot eficiency
- efficiency vs power heatmap?

- cite:Geva1992Feb quasi static efficiency is 1 - ω_c / ω_h
  - time vs temperature ratio scaling (5.36), for high
    temperatures... not so useful here

- cite:Wiedmann2021Jun otto fridge with HO as working medium
  - work over coupling strength, for diffirent cold bath temperatures
  - separating interaction and drive work
  - absorbed heat over coupling strength, for diffirent cold , for
    diffirent cold bath temperaturesbath temperatures
  - cite cooling condition from cite:Abah2016Apr
  - compare von neumann entropy of medium with weak coupling thermal state
- cite:Wiedmann2020Mar an actual engine, not fridge
  - shows quantities vs coupling
  - efficiency vs coupling and speed
  - power as function of modulation time, for different temperatures
  - discusses coupling work


**** TODO own scans
- scan compression ratio
- scan coupling strength
- scan scan cycle length

All nice and good, but we need concrete plans.

***** TODO Cycle Length + Coupling Strength
:LOGBOOK:
CLOCK: [2022-12-12 Mon 15:39]
CLOCK: [2022-12-12 Mon 14:45]--[2022-12-12 Mon 15:34] =>  0:49
CLOCK: [2022-12-12 Mon 14:05]--[2022-12-12 Mon 14:40] =>  0:35
CLOCK: [2022-12-12 Mon 13:29]--[2022-12-12 Mon 13:58] =>  0:29
:END:
- 2D grid with fixed numeber of cycles
- maybe ~5x5~ for now and later more

***** Compression Ratio at fixed coupling strength and cycle length
**** TODO scan timing
- compression and expansion timing variation in less markovian regime
- likely: no advantage

** Conclusion
- brief review of what has been achieved
- bath sections
- other bath observables accessible through tricks?
- other finite temp method... -> advantage: probably no derivatives of
  stochastic processes, but more hierarchy depth

* Tasks
** DONE Merge HOPS
:LOGBOOK:
CLOCK: [2022-11-23 Wed 23:39]--[2022-11-24 Thu 00:03] =>  0:24
CLOCK: [2022-11-23 Wed 22:45]--[2022-11-23 Wed 23:20] =>  0:35
CLOCK: [2022-11-23 Wed 22:10]--[2022-11-23 Wed 22:38] =>  0:28
CLOCK: [2022-11-23 Wed 21:39]--[2022-11-23 Wed 22:04] =>  0:25
:END:
- time dependent coupling
- online calc
- tests
- docs

** DONE Set up HO calcs with online analysis
:LOGBOOK:
CLOCK: [2022-11-30 Wed 16:27]--[2022-11-30 Wed 18:32] =>  2:05
CLOCK: [2022-11-30 Wed 15:22]--[2022-11-30 Wed 16:07] =>  0:45
CLOCK: [2022-11-30 Wed 13:21]--[2022-11-30 Wed 14:06] =>  0:45
CLOCK: [2022-11-30 Wed 12:26]--[2022-11-30 Wed 13:16] =>  0:50
CLOCK: [2022-11-30 Wed 11:11]--[2022-11-30 Wed 12:11] =>  1:00
CLOCK: [2022-11-29 Tue 17:53]--[2022-11-29 Tue 18:53] =>  1:00
CLOCK: [2022-11-29 Tue 15:33]--[2022-11-29 Tue 16:33] =>  1:00
CLOCK: [2022-11-29 Tue 15:05]--[2022-11-29 Tue 15:33] =>  0:28
CLOCK: [2022-11-28 Mon 14:45]--[2022-11-28 Mon 14:50] =>  0:05
CLOCK: [2022-11-28 Mon 13:04]--[2022-11-28 Mon 13:31] =>  0:27
CLOCK: [2022-11-28 Mon 12:06]--[2022-11-28 Mon 12:58] =>  0:52
CLOCK: [2022-11-28 Mon 11:28]--[2022-11-28 Mon 11:57] =>  0:29
CLOCK: [2022-11-28 Mon 10:52]--[2022-11-28 Mon 11:08] =>  0:16
CLOCK: [2022-11-26 Sat 12:29]--[2022-11-26 Sat 12:54] =>  0:25
CLOCK: [2022-11-26 Sat 12:02]--[2022-11-26 Sat 12:29] =>  0:27
CLOCK: [2022-11-26 Sat 11:10]--[2022-11-26 Sat 11:38] =>  0:28
CLOCK: [2022-11-26 Sat 10:17]--[2022-11-26 Sat 10:49] =>  0:32
CLOCK: [2022-11-25 Fri 20:20]--[2022-11-25 Fri 21:04] =>  0:44
CLOCK: [2022-11-25 Fri 19:27]--[2022-11-25 Fri 19:52] =>  0:25
CLOCK: [2022-11-25 Fri 18:42]--[2022-11-25 Fri 19:08] =>  0:26
CLOCK: [2022-11-25 Fri 18:12]--[2022-11-25 Fri 18:37] =>  0:25
CLOCK: [2022-11-24 Thu 15:38]--[2022-11-24 Thu 16:04] =>  0:26
CLOCK: [2022-11-24 Thu 15:08]--[2022-11-24 Thu 15:34] =>  0:26
CLOCK: [2022-11-24 Thu 14:31]--[2022-11-24 Thu 14:56] =>  0:25
CLOCK: [2022-11-24 Thu 13:59]--[2022-11-24 Thu 14:25] =>  0:26
CLOCK: [2022-11-24 Thu 11:51]--[2022-11-24 Thu 12:06] =>  0:15
:END:
** TODO sort out richards libraries

* Nice to Haves
** HOLD test online calc
** HOLD test dynamic matrix

*  Clock Report
- the first days are pretty broken. emacs crashed etc...

#+BEGIN: clocktable :scope file  :step day :tstart "<-1w>" :tend "<now>" :compact nil

Daily report: [2022-11-21 Mon]
| Headline     | Time   |
|--------------+--------|
| *Total time* | *0:00* |

Daily report: [2022-11-22 Tue]
| Headline     | Time   |
|--------------+--------|
| *Total time* | *0:00* |

Daily report: [2022-11-23 Wed]
| Headline       | Time   |      |
|----------------+--------+------|
| *Total time*   | *1:49* |      |
|----------------+--------+------|
| Tasks          | 1:49   |      |
| \_  Merge HOPS |        | 1:49 |

Daily report: [2022-11-24 Thu]
| Headline                                 | Time   |      |
|------------------------------------------+--------+------|
| *Total time*                             | *2:01* |      |
|------------------------------------------+--------+------|
| Tasks                                    | 2:01   |      |
| \_  Merge HOPS                           |        | 0:03 |
| \_  Set up HO calcs with online analysis |        | 1:58 |

Daily report: [2022-11-25 Fri]
| Headline                                 | Time   |      |
|------------------------------------------+--------+------|
| *Total time*                             | *2:00* |      |
|------------------------------------------+--------+------|
| Tasks                                    | 2:00   |      |
| \_  Set up HO calcs with online analysis |        | 2:00 |

Daily report: [2022-11-26 Sat]
| Headline                                 | Time   |      |
|------------------------------------------+--------+------|
| *Total time*                             | *1:52* |      |
|------------------------------------------+--------+------|
| Tasks                                    | 1:52   |      |
| \_  Set up HO calcs with online analysis |        | 1:52 |

Daily report: [2022-11-27 Sun]
| Headline     | Time   |
|--------------+--------|
| *Total time* | *0:00* |

Daily report: [2022-11-28 Mon]
| Headline                                 |   Time |      |
|------------------------------------------+--------+------|
| *Total time*                             | *3:44* |      |
|------------------------------------------+--------+------|
| Outline                                  |   1:35 |      |
| \_  Application                          |        | 1:35 |
| Tasks                                    |   2:09 |      |
| \_  Set up HO calcs with online analysis |        | 2:09 |
#+END:
